#학번을 입력받아 학과를 출력하기

x = input()

l_2 = [0,"뉴미디어소프트웨어과","뉴미디어웹솔루션과","뉴미디어디자인과"]
l_3 = [0,"인터렉티브미디어과","뉴미디어디자인과","뉴미디어솔루션과"]

if x[0] == "2" or x[0] == "1":
    if x[1] == "1" or x[1] == "2":
        print("뉴미디어소프트웨어과")
    elif x[1] == "3" or x[1] == "4":
        print("뉴미디어웹솔루션과")
    elif x[1] == "5" or x[1] == "6":
        print("뉴미디어디자인과")
    else:
        print("잘못된 학번입니다.")
elif x[0] == "3":
    if x[1] == "1" or x[1] == "2":
        print("인터렉티브미디어과")
    elif x[1] == "3" or x[1] == "4":
        print("뉴미디어디자인과")
    elif x[1] == "5" or x[1] == "6":
        print("뉴미디어솔루션과")
    else:
        print("잘못된 학번입니다.")

else:
    print("잘못된 학번입니다.")